# 1. 2 ~ 100 사이의 소수를 출력하는 코드를 작성 (단, 한라인에 5개씩 출력)

#     2   3   5   7   11
#     13  17  19  23
#     ...
#     97

count = 0

for num in range(2, 101):

    i = 2
    while i < num and num % i != 0:
        i += 1

    if i == num:
        print("%4d" % num, end=" ")
        count += 1

        if count % 5 == 0:
            print()

#=================================================================================================================

# 2. 시작단을 입력하고, 종료단을 입력하면 구구단을 출력하는 코드 작성

#     시작단 : 2
#     종료단 : 9

# *** 2단 ***
# 2 * 1 = 2
# ...
# 2 * 9 = 18
# *** 3단 ***
# ...
# 9 * 9 = 81

start = int(input("시작단 : "))
end = int(input("종료단 : "))

for dan in range(start, end + 1):
    print("*** " + str(dan) + "단 ***")
    
    for num in range(1, 10):
        result = dan * num
        print(str(dan) + " * " + str(num) + " = " + str(result))

#=================================================================================================================


# 3. 구구단을 출력하는데 한 라인에 3단씩 출력
#     *** 2단 ***          *** 3단 ***        *** 4단 ***
#     2 * 1 = 2           3 * 1 = 3           4 * 1 = 4
#     ...
#     *** 5단 ***          *** 6단 ***        *** 7단 ***
#     *** 8단 ***          *** 9단 ***

#     rot dan in range(2, 10):

dans = [2,3,4,5,6,7,8,9]

for i in range(0, len(dans), 3):

    # 단 제목
    for j in range(i, i+3):
        if j < len(dans):
            print("%17s" % ("*** " + str(dans[j]) + "단 ***"), end="")
    print()

    # 곱하기 부분
    for num in range(1,10):
        for j in range(i, i+3):
            if j < len(dans):
                text = str(dans[j]) + " * " + str(num) + " = " + str(dans[j]*num)
                print("%17s" % text, end="")
        print()

    print()


#=================================================================================================================


    # 4. 369게임 숫자에 (3,6,9가 들어가면 박수)
    # 10이상 100미만의 숫자 입력 : 35
    # [1 ~ 35 까지의 369게임 시작]
    # 1
    # 2
    # 짝
    # 4
    # 5
    # 짝
    # 7
    # 8
    # 짝
    # 뽀숑
    # 11
    # 12
    # 짝
    # 14
    # 15
    # 짝
    # 17
    # 18
    # 짝
    # 뽀뽀숑
    # ...
    # 짝뽀뽀뽀숑
    # 짝
    # 짝뽀뽀뽀숑
    # 짝
    # 짝
    # 짝짝
    # 짝
    # 짝


num = int(input("10이상 100미만의 숫자 입력 : "))

print("[1 ~", num, "까지의 369게임 시작]")

for i in range(1, num+1):

    clap = ""

    for j in str(i):
        if j == '3' or j == '6' or j == '9':
            clap = clap + "짝"

    if clap == "":
        print(i)
    else:
        print(clap)